<script lang="ts" setup>
const answeredQuestions = [
  {
    question: 'آیا می توانم به صورت حضوری اقدام کنم؟',
    answer:
      'به طور پیشفرض خیر، به دلایلی نمی توانیم فعلا به صورت حضوری در خدمت شما باشیم؛ لطف کنید با استفاده از تیکت به ما پیام دهید.'
  },
  {
    question: 'من چگونه می توانم به شما اعتماد کنم؟',
    answer:
      'ما تمامی مجوز های لازم را دریافت کرده ایم، ضمن اینکه این سایت در سامانه ساماندهی و اینماد ثبت شده است. ضمنا درصورت هر مشکلی میتوانید با پشتیبانی در تماس باشید.'
  },
  {
    question: 'آیا می توانم با کارت بانکی خرید انجام دهم؟',
    answer:
      'بله، ما پشتیبانی از پرداخت الکترونیکی را ارائه می دهیم و می توانید با استفاده از کارت بانکی خرید خود را انجام دهید.'
  },
  {
    question: 'چگونه می توانم با پشتیبانی تماس بگیرم؟',
    answer:
      'برای برقراری تماس با پشتیبانی می توانید از سامانه گفتگوی آنلاین، یا یکی از راه های ارتباطی مشخص شده در ارتباط با ما، استفاده کنید.'
  },
  {
    question: 'آیا نیاز به نوشتن قرارداد خاصی برای ارائه خدمات هست؟',
    answer:
      'بله همینطور است؛ برای شروع فرایند ارائه خدمت (اعم از طراحی و غیره) نیاز است تا قراردادی را با تنظیم کنید؛ در این قرارداد، قیمت پیشنهادی و توافقی، مدت زمان فرایند و سایر مشخصات قید شده است.'
  },
  {
    question: 'چگونه می توانم از خدمات شما استفاده کنم؟',
    answer:
      'برای درخواست خدمت، باید ابتدا در سایت، خدمت مورد نظر خود را انتخاب، سپس فرم مورد نیاز را تکمیل و منتظر تماس یا ایمیل کارشناسان ما باشید.'
  },
  {
    question: 'چگونه می توانم از نحوه انجام درخواستم مطلع شوم؟',
    answer:
      'پس از تکمیل فرم، کد رهگیری به شما تعلق می گیرد، با آن کد وارد سامانه رهگیری خدمات صالتک شوید و از فرایند انجام آن مطلع شوید.'
  },
  {
    question: 'نرم افزار های شما را چگونه می توانم دانلود کنم؟',
    answer:
      'شما می توانید نرم افزار های اندرویدی را از طریق مایکت یا کافه بازار و نرم افزار های ویندوزی را مستقیماً از طریق در سایت اقدام به دانلود کنید.'
  }
]
</script>

<template>
  <div class="container">
    <h1 class="title">سؤالات متداول</h1>
    <p class="description">
      سؤالات مهمی که در ذهن شماست، در اینجا مطرح و پاسخ آنها قرار داده شده است.
    </p>
    <div class="spacer" />
    <Accordion>
      <AccordionTab
        v-for="answeredQuestion in answeredQuestions"
        :header="answeredQuestion.question"
      >
        <p class="m-0">{{ answeredQuestion.answer }}</p>
      </AccordionTab>
    </Accordion>
  </div>
</template>

<style scoped>
* {
  direction: rtl;
}

.container {
  width: 100%;
  padding: 4rem 2rem;
}

.title {
  font-family: 'Peyda Black', sans-serif;
  font-size: clamp(1rem, 3vw, 2.25rem);
  text-align: center;
}

.description {
  font-family: 'Peyda Medium', sans-serif;
  font-size: clamp(1rem, 1.3vw, 2rem);
  margin: 2.5rem 2.5rem 0;
  text-align: center;
}
</style>
