<script lang="ts" setup></script>

<template>
  <div class="container">
    <h1 class="title">حریم خصوصی</h1>
    <div class="spacer" />
    <div class="privacy">
      <p>
        ما در صالتک به حریم خصوصی شما احترام می‌گذاریم و متعهد به حفظ آن هستیم. این سیاست حریم خصوصی
        نحوه جمع‌آوری، استفاده و افشای اطلاعات شخصی شما را که هنگام استفاده از وب‌سایت و خدمات ما
        ارائه می‌دهید، شرح می‌دهد.
      </p>

      <h2>اطلاعات جمع‌آوری شده</h2>

      <ul>
        <li>
          <h3>اطلاعات تماس:</h3>
          <ul>
            <li>نام</li>
            <li>آدرس ایمیل</li>
            <li>شماره تلفن</li>
          </ul>
        </li>
        <li>
          <h3>اطلاعات حساب:</h3>
          <ul>
            <li>نام کاربری</li>
            <li>رمز عبور</li>
          </ul>
        </li>
        <li>
          <h3>اطلاعات فردی:</h3>
          <p>
            برای عقد قرارداد، نیاز به اطلاعات فردی شما داریم، به شما اطمینان می دهیم این اطلاعات نزد
            ما محفوظ هستند.
          </p>
        </li>
        <li>
          <h3>اطلاعات پرداخت:</h3>
          <ul>
            <li>اطلاعات کارت اعتباری یا بانکی</li>
          </ul>
        </li>
        <li>
          <h3>اطلاعات مربوط به استفاده از وب‌سایت:</h3>
          <ul>
            <li>صفحات بازدید شده</li>
            <li>تعداد دفعات بازدید</li>
            <li>تاریخ و زمان بازدید</li>
            <li>آدرس IP</li>
          </ul>
        </li>
        <li>
          <h3>اطلاعات مربوط به دستگاه:</h3>
          <ul>
            <li>نوع دستگاه</li>
            <li>سیستم عامل</li>
            <li>مرورگر</li>
          </ul>
        </li>
      </ul>

      <Divider />
      <h2>استفاده از اطلاعات</h2>

      <ul>
        <li>ارائه خدمات به شما</li>
        <li>بهبود تجربه کاربری شما</li>
        <li>ارسال ایمیل‌های اطلاع‌رسانی و تبلیغاتی</li>
        <li>تجزیه و تحلیل داده‌ها برای بهبود خدمات</li>
      </ul>

      <Divider />
      <h2>افشای اطلاعات</h2>

      <p>ما اطلاعات شما را به اشخاص ثالث جز در موارد زیر افشا نخواهیم کرد:</p>

      <ul>
        <li>با رضایت شما</li>
        <li>به منظور ارائه خدمات به شما (مانند ارائه دهندگان خدمات پرداخت)</li>
        <li>در صورت الزام قانونی</li>
        <li>برای حفظ حقوق و مالکیت خود</li>
      </ul>

      <Divider />
      <h2>امنیت اطلاعات</h2>

      <p>ما برای حفظ امنیت اطلاعات شما از اقدامات امنیتی فنی و سازمانی مناسب استفاده می‌کنیم.</p>

      <Divider />
      <h2>کوکی‌ها</h2>

      <p>
        ما از کوکی‌ها برای بهبود تجربه کاربری شما استفاده می‌کنیم. کوکی‌ها فایل‌های کوچکی هستند که
        در رایانه شما ذخیره می‌شوند و اطلاعات مربوط به فعالیت شما در وب‌سایت را ذخیره می‌کنند.
      </p>

      <Divider />
      <h2>حقوق شما</h2>

      <p>
        شما حق دسترسی، اصلاح، حذف و محدود کردن پردازش اطلاعات خود را دارید. همچنین می‌توانید از
        دریافت ایمیل‌های تبلیغاتی ما انصراف دهید.
      </p>

      <Divider />
      <h2>ارتباط با ما</h2>

      <p>
        اگر سوالی در مورد این سیاست حریم خصوصی دارید، می‌توانید با ما در
        <a class="link" href="/contactus">ارتباط باشید.</a>
      </p>
    </div>
  </div>
</template>

<style scoped>
* {
  direction: rtl;
}

.container {
  width: 100%;
  padding: 4rem 2rem;
}

.title {
  font-family: 'Peyda Black', sans-serif;
  font-size: clamp(1rem, 3vw, 2.25rem);
  text-align: center;
}

.privacy {
  margin: 2rem;
}

h2 {
  font-family: 'Peyda Bold', sans-serif;
  font-size: clamp(1rem, 1.6vw, 2rem);
  margin: 1em 0;
}

h3 {
  font-family: 'Peyda Medium', sans-serif;
  font-size: clamp(1rem, 1.4vw, 2rem);
  margin: 1em 0;
}

p,
li {
  font-family: 'Peyda Regular', sans-serif;
  font-size: clamp(1rem, 1.25vw, 2rem);
  margin: 1em 0;
}

.link {
  color: var(--primary-500);
}
</style>
