<script lang="ts" setup></script>

<template>
  <div class="container">
    <h1 class="title">قوانین و مقررات</h1>
    <div class="spacer" />
    <div class="terms">
      <h2>مقدمه</h2>

      <p>
        به وبسایت صالتک خوش آمدید. این شرکت توسط محمد صالح مسعودی مقدم اداره می‌شود.<br />صالتک تابع
        قوانین جمهوری اسلامی ایران می باشد و استفاده از این وبسایت و خدمات آن مشمول قوانین و مقررات
        زیر است:
      </p>

      <h2>شرایط استفاده</h2>

      <ul>
        <li>
          <strong>کاربر:</strong> به هر شخص حقیقی یا حقوقی که از وبسایت و خدمات آن استفاده می‌کند،
          کاربر گفته می‌شود.
        </li>
        <li>
          <strong>محتوا:</strong> شامل هرگونه متن، تصویر، ویدئو، صدا، کد و سایر اطلاعاتی است که در
          وبسایت منتشر می‌شود.
        </li>
        <li>
          <strong>خدمات:</strong> شامل هرگونه خدماتی است که توسط وبسایت ارائه می‌شود، مانند طراحی
          اپلیکیشن، طراحی وبسایت، خدمات پشتیبانی سایت و ...
        </li>
      </ul>

      <Divider />
      <h2>قوانین کلی</h2>

      <ul>
        <li>کاربر موظف است از وبسایت و خدمات آن به طور قانونی و اخلاقی استفاده کند.</li>
        <li>کاربر حق ندارد به اطلاعات یا داده‌های دیگران دسترسی غیرمجاز داشته باشد.</li>
        <li>کاربر حق ندارد محتوای غیرقانونی یا توهین‌آمیز در وبسایت منتشر کند.</li>
        <li>کاربر موظف است به حقوق مالکیت معنوی وبسایت و سایر کاربران احترام بگذارد.</li>
        <li>
          وبسایت حق دارد در صورت نقض قوانین و مقررات توسط کاربر، دسترسی او را به وبسایت و خدمات آن
          مسدود کند.
        </li>
      </ul>

      <Divider />
      <h2>مسئولیت‌ها</h2>

      <ul>
        <li>وبسایت هیچگونه مسئولیتی در قبال محتوای منتشر شده توسط کاربران ندارد.</li>
        <li>
          وبسایت هیچگونه مسئولیتی در قبال خسارات ناشی از استفاده غیرمجاز از وبسایت و خدمات آن ندارد.
        </li>
        <li>کاربر مسئول حفظ اطلاعات حساب کاربری خود و جلوگیری از دسترسی غیرمجاز به آن است.</li>
        <li>کاربر مسئول صحت و درستی اطلاعاتی است که در وبسایت ارائه می‌دهد.</li>
      </ul>

      <Divider />
      <h2>قوانین مربوط به خدمات</h2>

      <h3>طراحی اپلیکیشن</h3>

      <ul>
        <li>کاربر موظف است قبل از سفارش، شرح کاملی از نیازها و خواسته‌های خود را ارائه دهد.</li>
        <li>وبسایت هیچگونه تعهدی در قبال تطابق کامل اپلیکیشن نهایی با خواسته‌های کاربر ندارد.</li>
        <li>مالکیت معنوی اپلیکیشن نهایی متعلق به وبسایت خواهد بود.</li>
      </ul>

      <h3>طراحی وبسایت</h3>

      <ul>
        <li>کاربر موظف است قبل از سفارش، شرح کاملی از نیازها و خواسته‌های خود را ارائه دهد.</li>
        <li>وبسایت هیچگونه تعهدی در قبال تطابق کامل وبسایت نهایی با خواسته‌های کاربر ندارد.</li>
        <li>مالکیت معنوی وبسایت نهایی متعلق به وبسایت خواهد بود.</li>
      </ul>

      <Divider />
      <h3>خدمات پشتیبانی سایت</h3>

      <ul>
        <li>
          خدمات پشتیبانی سایت شامل رفع اشکالات فنی و پاسخ به سوالات کاربر در مورد وبسایت یا اپلیکیشن
          او است.
        </li>
        <li>وبسایت هیچگونه تعهدی در قبال حل کامل مشکلات فنی وبسایت یا اپلیکیشن کاربر ندارد.</li>
      </ul>

      <Divider />
      <h2>قوانین مربوط به پرداخت</h2>

      <ul>
        <li>کاربر موظف است هزینه خدمات را قبل از شروع کار پرداخت کند.</li>
        <li>در صورت انصراف کاربر از سفارش، هزینه پرداخت شده به او بازگردانده نخواهد شد.</li>
        <li>
          وبسایت حق دارد در صورت عدم پرداخت به موقع هزینه خدمات، دسترسی کاربر به خدمات را مسدود کند.
        </li>
      </ul>

      <Divider />
      <h2>قوانین مربوط به حریم خصوصی</h2>

      <ul>
        <li>وبسایت به حریم خصوصی کاربران احترام می‌گذارد و</li>
        <li>برای اطلاعات بیشتر در مورد سیاست حریم خصوصی وبسایت، به صفحه حریم خصوصی مراجعه کنید.</li>
      </ul>

      <Divider />
      <h2>حل اختلاف</h2>

      <ul>
        <li>
          در صورت بروز هرگونه اختلاف بین کاربر و وبسایت، طرفین موظف هستند برای حل اختلاف از طریق
          مذاکره و توافق تلاش کنند.
        </li>
        <li>برای اطلاعات بیشتر در مورد سیاست حریم خصوصی وبسایت، به صفحه حریم خصوصی مراجعه کنید.</li>
      </ul>
    </div>
  </div>
</template>

<style scoped>
* {
  direction: rtl;
}

.container {
  width: 100%;
  padding: 4rem 2rem;
}

.title {
  font-family: 'Peyda Black', sans-serif;
  font-size: clamp(1rem, 3vw, 2.25rem);
  text-align: center;
}

.terms {
  margin: 2rem;
}

h2 {
  font-family: 'Peyda Bold', sans-serif;
  font-size: clamp(1rem, 1.6vw, 2rem);
  margin: 1em 0;
}

h3 {
  font-family: 'Peyda Medium', sans-serif;
  font-size: clamp(1rem, 1.4vw, 2rem);
  margin: 1em 0;
}

p,
li {
  font-family: 'Peyda Regular', sans-serif;
  font-size: clamp(1rem, 1.25vw, 2rem);
  margin: 1em 0;
}

.link {
  color: var(--primary-500);
}
</style>
